#include "main.h"

void Help()
{
    printf("****************************************************\n");
    printf("   *     学生成绩管理系统---帮助菜单            *       \n");
    printf("****************************************************\n");
    printf("   *     H  = 显示帮助菜单                      *   \n");
    printf("   *     T  = 成绩录入                          * \n");
    printf("   *     A  = 计算学生平均分                    *  \n");
    printf("   *     L  = 列出成绩表                        *  \n");
    printf("   *     P  = 按平均成绩由高到低排序            *   \n");
    printf("   *     S  = 按学号查询学生成绩                *  \n");
    printf("   *     D  = 删除学生信息                      * \n");
    printf("   *     RE = 恢复已删除学生信息                *  \n");
    printf("   *     DL = 已删除学生信息列表                *  \n");
    printf("   *     C  = 清屏                              *  \n");
    printf("   *     Q  = 退出系统                          *   \n");
    printf("****************************************************\n");
    printf("   *     Copyright <C> 2024.11.15 By 李国强     *    \n");
    printf("****************************************************\n");
}